# SEM 1: –û–°–ù–û–í–ù–ê –ú–†–ï–ñ–û–í–ê –¢–û–ü–û–õ–û–ì–ò–Ø
## O—Å–Ω–æ–≤–∏ –Ω–∞ IOS; –ë–∞–∑–æ–≤–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ Switch –∏ Router

**–¶–µ–ª:** –î–∞ —Å–µ –Ω–∞—É—á–∏—Ç–µ –¥–∞ —Å—ä–∑–¥–∞–≤–∞—Ç–µ –ø—Ä–æ—Å—Ç–∞ –º—Ä–µ–∂–∞ –∏ –¥–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞—Ç–µ –æ—Å–Ω–æ–≤–Ω–∏—Ç–µ –ø–∞—Ä–∞–º–µ—Ç—Ä–∏ –Ω–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ç–∞.

**–ü—Ä–æ–¥—ä–ª–∂–∏—Ç–µ–ª–Ω–æ—Å—Ç:** 60-90 –º–∏–Ω—É—Ç–∏

**–ù–µ–æ–±—Ö–æ–¥–∏–º–æ:** Cisco Packet Tracer

---

## –û–°–ù–û–í–ù–ò –ö–û–ù–¶–ï–ü–¶–ò–ò (–ü–†–ï–î–ò –î–ê –ó–ê–ü–û–ß–ù–ï–ú)

### –ö–∞–∫–≤–æ –µ Router (–ú–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ç–æ—Ä)?

**Router** –µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ, –∫–æ–µ—Ç–æ **—Å–≤—ä—Ä–∑–≤–∞ —Ä–∞–∑–ª–∏—á–Ω–∏ –º—Ä–µ–∂–∏** –∏ —Ä–µ—à–∞–≤–∞ –Ω–∞–∫—ä–¥–µ –¥–∞ –∏–∑–ø—Ä–∞—Ç–∏ –¥–∞–Ω–Ω–∏—Ç–µ.

```
–ê–Ω–∞–ª–æ–≥–∏—è: Router –µ –∫–∞—Ç–æ –ø–æ—â–µ–Ω—Å–∫–∏ —Å–ª—É–∂–∏—Ç–µ–ª
- –ü–æ–ª—É—á–∞–≤–∞ –ø–∞–∫–µ—Ç–∏ —Å –∞–¥—Ä–µ—Å–∏
- –†–µ—à–∞–≤–∞ –ø–æ –∫–æ–π –ø—ä—Ç –¥–∞ –≥–∏ –∏–∑–ø—Ä–∞—Ç–∏
- –°–≤—ä—Ä–∑–≤–∞ —Ä–∞–∑–ª–∏—á–Ω–∏ "–∫–≤–∞—Ä—Ç–∞–ª–∏" (–º—Ä–µ–∂–∏)
```

**–û—Å–Ω–æ–≤–Ω–∏ —Ö–∞—Ä–∞–∫—Ç–µ—Ä–∏—Å—Ç–∏–∫–∏:**
- –†–∞–±–æ—Ç–∏ –Ω–∞ **Layer 3** (–º—Ä–µ–∂–æ–≤ —Å–ª–æ–π)
- –ò–º–∞ **IP –∞–¥—Ä–µ—Å–∏** –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏—Ç–µ —Å–∏
- –ü—Ä–∞–≤–∏ **routing decisions** (–∫—ä–¥–µ –¥–∞ –∏–∑–ø—Ä–∞—Ç–∏ –ø–∞–∫–µ—Ç–∞)
- –°–≤—ä—Ä–∑–≤–∞ **—Ä–∞–∑–ª–∏—á–Ω–∏ IP –º—Ä–µ–∂–∏**

---

### –ö–∞–∫–≤–æ –µ Switch (–ö–æ–º—É—Ç–∞—Ç–æ—Ä)?

**Switch** –µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ, –∫–æ–µ—Ç–æ **—Å–≤—ä—Ä–∑–≤–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –≤ –µ–¥–Ω–∞ –º—Ä–µ–∂–∞** –∏ –ø—Ä–µ–Ω–∞—Å–æ—á–≤–∞ —Ç—Ä–∞—Ñ–∏–∫ –º–µ–∂–¥—É —Ç—è—Ö.

```
–ê–Ω–∞–ª–æ–≥–∏—è: Switch –µ –∫–∞—Ç–æ —Ç–µ–ª–µ—Ñ–æ–Ω–Ω–∞ —Ü–µ–Ω—Ç—Ä–∞–ª–∞
- –°–≤—ä—Ä–∑–≤–∞ –º–Ω–æ–≥–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞
- –ü—Ä–µ–ø—Ä–∞—â–∞ —Å—ä–æ–±—â–µ–Ω–∏—è –º–µ–∂–¥—É —Ç—è—Ö
- –í—Å–∏—á–∫–∏ —Å–∞ –≤ –µ–¥–Ω–∞ "—Å–≥—Ä–∞–¥–∞" (–º—Ä–µ–∂–∞)
```

**–û—Å–Ω–æ–≤–Ω–∏ —Ö–∞—Ä–∞–∫—Ç–µ—Ä–∏—Å—Ç–∏–∫–∏:**
- –†–∞–±–æ—Ç–∏ –Ω–∞ **Layer 2** (–∫–∞–Ω–∞–ª–µ–Ω —Å–ª–æ–π)
- –§–æ—Ä–≤–∞—Ä–¥–≤–∞ frames –Ω–∞ –±–∞–∑–∞ **MAC –∞–¥—Ä–µ—Å–∏**
- –°—ä–∑–¥–∞–≤–∞ **–ª–æ–∫–∞–ª–Ω–∞ –º—Ä–µ–∂–∞** (LAN)
- –ü–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ –Ω–µ –ø—Ä–∞–≤–∏ routing –º–µ–∂–¥—É –º—Ä–µ–∂–∏

---

### IP –ê–¥—Ä–µ—Å–∏—Ä–∞–Ω–µ - –æ—Å–Ω–æ–≤–∏

**IP –∞–¥—Ä–µ—Å** –µ —É–Ω–∏–∫–∞–ª–µ–Ω –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –Ω–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ –≤ –º—Ä–µ–∂–∞—Ç–∞.

```
–§–æ—Ä–º–∞—Ç: 192.168.1.1
         ‚îÇ   ‚îÇ   ‚îÇ ‚îÇ
         ‚îÇ   ‚îÇ   ‚îÇ ‚îî‚îÄ Host (—É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ)
         ‚îÇ   ‚îÇ   ‚îî‚îÄ‚îÄ‚îÄ Subnet (–ø–æ–¥–º—Ä–µ–∂–∞)
         ‚îÇ   ‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ Network (–º—Ä–µ–∂–∞)
         ‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ Class (–∫–ª–∞—Å)
```

**Subnet Mask:** –û–ø—Ä–µ–¥–µ–ª—è –∫–æ—è —á–∞—Å—Ç –µ –º—Ä–µ–∂–∞ –∏ –∫–æ—è –µ host
```
255.255.255.0 –æ–∑–Ω–∞—á–∞–≤–∞:
- –ü—ä—Ä–≤–∏—Ç–µ 3 –æ–∫—Ç–µ—Ç–∞ (192.168.1) = –º—Ä–µ–∂–∞
- –ü–æ—Å–ª–µ–¥–Ω–∏—è—Ç –æ–∫—Ç–µ—Ç (.1, .2, .3...) = —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –≤ –º—Ä–µ–∂–∞—Ç–∞
```

**Default Gateway:** IP –∞–¥—Ä–µ—Å—ä—Ç –Ω–∞ Router-–∞ (–∏–∑—Ö–æ–¥—ä—Ç –∫—ä–º –¥—Ä—É–≥–∏ –º—Ä–µ–∂–∏)
```
–ö–æ–≥–∞—Ç–æ PC –∏—Å–∫–∞ –¥–∞ –∏–∑–ø—Ä–∞—Ç–∏ –¥–∞–Ω–Ω–∏ –∏–∑–≤—ä–Ω –ª–æ–∫–∞–ª–Ω–∞—Ç–∞ –º—Ä–µ–∂–∞,
–∏–∑–ø—Ä–∞—â–∞ –≥–∏ –∫—ä–º gateway-—è (Router-–∞)
```

---

## –ß–ê–°–¢ 1: –ò–∑–≥—Ä–∞–∂–¥–∞–Ω–µ –Ω–∞ —Ç–æ–ø–æ–ª–æ–≥–∏—è—Ç–∞ (15 –º–∏–Ω)

### –£—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –∑–∞ –¥–æ–±–∞–≤—è–Ω–µ:
- 1x Router 2911 (R1)
- 1x Switch 2960 (SW1)
- 3x PC (PC1, PC2, PC3)
- Cables: Copper Straight-Through (–ø—Ä–∞–≤–∏ –∫–∞–±–µ–ª–∏)

### –ö–∞–∫ –¥–∞ –¥–æ–±–∞–≤–∏—Ç–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –≤ Packet Tracer:

1. **–î–æ–ª–µ–Ω –ª—è–≤ —ä–≥—ä–ª:**
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ **Routers** ‚Üí –∏–∑–±–µ—Ä–∏ **2911**
   - –ü–ª—ä–∑–Ω–∏ –≤ —Ä–∞–±–æ—Ç–Ω–∞—Ç–∞ –æ–±–ª–∞—Å—Ç
   
2. **Switches:**
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ **Switches** ‚Üí –∏–∑–±–µ—Ä–∏ **2960**
   - –ü–ª—ä–∑–Ω–∏ –≤ —Ä–∞–±–æ—Ç–Ω–∞—Ç–∞ –æ–±–ª–∞—Å—Ç

3. **End Devices:**
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ **End Devices** ‚Üí –∏–∑–±–µ—Ä–∏ **PC**
   - –ü–ª—ä–∑–Ω–∏ 3 –ø—ä—Ç–∏ (–∑–∞ PC1, PC2, PC3)

4. **–°–≤—ä—Ä–∑–≤–∞–Ω–µ —Å –∫–∞–±–µ–ª–∏:**
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ **Connections** (lightning bolt icon)
   - –ò–∑–±–µ—Ä–∏ **Copper Straight-Through** (—á–µ—Ä–Ω–∞ –Ω–µ–ø—Ä–µ–∫—ä—Å–Ω–∞—Ç–∞ –ª–∏–Ω–∏—è)
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ –ø—ä—Ä–≤–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ ‚Üí –∏–∑–±–µ—Ä–∏ –ø–æ—Ä—Ç
   - –ö–ª–∏–∫–Ω–∏ –Ω–∞ –≤—Ç–æ—Ä–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ ‚Üí –∏–∑–±–µ—Ä–∏ –ø–æ—Ä—Ç

---

### –°–≤—ä—Ä–∑–≤–∞–Ω–µ –Ω–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ç–∞:

```
Router GigabitEthernet0/0 ‚Üê‚Üí Switch FastEthernet0/1
Switch FastEthernet0/2 ‚Üê‚Üí PC1 FastEthernet0
Switch FastEthernet0/3 ‚Üê‚Üí PC2 FastEthernet0
Switch FastEthernet0/4 ‚Üê‚Üí PC3 FastEthernet0
```

**–í–∞–∂–Ω–æ:** 
- Router-Switch –≤—Ä—ä–∑–∫–∞: –∏–∑–ø–æ–ª–∑–≤–∞–π GigE –ø–æ—Ä—Ç –Ω–∞ router-–∞ (–ø–æ-–±—ä—Ä–∑)
- Switch-PC –≤—Ä—ä–∑–∫–∏: –æ–±–∏–∫–Ω–æ–≤–µ–Ω–∏ FastEthernet –ø–æ—Ä—Ç–æ–≤–µ

---

### –°—Ö–µ–º–∞ –Ω–∞ —Ç–æ–ø–æ–ª–æ–≥–∏—è—Ç–∞:

```
              [Router R1]
              192.168.1.1
                   |
               GigE0/0
                   |
              [Switch SW1]
              192.168.1.2
               /    |    \
           Fa0/2 Fa0/3 Fa0/4
             /     |     \
         [PC1]  [PC2]  [PC3]
        .10     .11     .12
    
    –ú—Ä–µ–∂–∞: 192.168.1.0/24
    Gateway: 192.168.1.1
```

---

## –ß–ê–°–¢ 2: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ Router (20 –º–∏–Ω)

### –°—Ç—ä–ø–∫–∞ 1: –í–ª–∏–∑–∞–Ω–µ –≤ Router

1. –ö–ª–∏–∫–Ω–µ—Ç–µ –≤—ä—Ä—Ö—É **Router** –∏–∫–æ–Ω–∞
2. –ò–∑–±–µ—Ä–µ—Ç–µ —Ç–∞–± **CLI** (Command Line Interface)
3. –ù–∞—Ç–∏—Å–Ω–µ—Ç–µ **Enter** –∑–∞ –¥–∞ –≤–∏–¥–∏—Ç–µ prompt-–∞

```
–í–∏–∂–¥–∞—Ç–µ:

Would you like to enter the initial configuration dialog? [yes/no]: 

–ù–∞–ø–∏—à–µ—Ç–µ: no [Enter]
```

**–ó–∞—â–æ "no"?** 
- Setup wizard –µ –∑–∞ –Ω–∞—á–∏–Ω–∞–µ—â–∏ –∏ –µ –æ–≥—Ä–∞–Ω–∏—á–µ–Ω
- –ù–∏–µ —â–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–º–µ —Ä—ä—á–Ω–æ (–ø–æ-–≥—ä–≤–∫–∞–≤–æ)

---

### –°—Ç—ä–ø–∫–∞ 2: –ë–∞–∑–æ–≤–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è

```cisco
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# no ip domain-lookup
R1(config)# enable secret class123
R1(config)# line console 0
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# logging synchronous
R1(config-line)# exit
```

**–î–µ—Ç–∞–π–ª–Ω–æ –æ–±—è—Å–Ω–µ–Ω–∏–µ –Ω–∞ –í–°–Ø–ö–ê –∫–æ–º–∞–Ω–¥–∞:**

| –ö–æ–º–∞–Ω–¥–∞ | –ö–∞–∫–≤–æ –ø—Ä–∞–≤–∏ | –ó–∞—â–æ –µ –≤–∞–∂–Ω–æ | –ü—Ä–∏–º–µ—Ä —Ä–µ–∑—É–ª—Ç–∞—Ç |
|---------|-------------|--------------|-----------------|
| `enable` | –í–ª–∏–∑–∞ –≤ **privileged EXEC mode** | –î–∞–≤–∞ –¥–æ—Å—Ç—ä–ø –¥–æ –≤—Å–∏—á–∫–∏ –∫–æ–º–∞–Ω–¥–∏ | Prompt-—ä—Ç —Å—Ç–∞–≤–∞ `Router#` –≤–º–µ—Å—Ç–æ `Router>` |
| `configure terminal` | –í–ª–∏–∑–∞ –≤ **global configuration mode** | –ü–æ–∑–≤–æ–ª—è–≤–∞ –ø—Ä–æ–º–µ–Ω–∏ –≤ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ | Prompt —Å—Ç–∞–≤–∞ `Router(config)#` |
| `hostname R1` | –ó–∞–¥–∞–≤–∞ –∏–º–µ –Ω–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ—Ç–æ | –ó–∞ –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ü–∏—è (–≤–º–µ—Å—Ç–æ "Router" –≤–∏–∂–¥–∞ —Å–µ "R1") | Prompt —Å—Ç–∞–≤–∞ `R1(config)#` |
| `no ip domain-lookup` | –ò–∑–∫–ª—é—á–≤–∞ –∞–≤—Ç–æ–º–∞—Ç–∏—á–Ω–æ—Ç–æ DNS —Ç—ä—Ä—Å–µ–Ω–µ | –ö–æ–≥–∞—Ç–æ –Ω–∞–ø–∏—à–µ—Ç–µ –≥—Ä–µ—à–Ω–∞ –∫–æ–º–∞–Ω–¥–∞, –Ω–µ —á–∞–∫–∞ DNS –æ—Ç–≥–æ–≤–æ—Ä (–ø–æ-–±—ä—Ä–∑–æ) | –ë–µ–∑ delay –ø—Ä–∏ –≥—Ä–µ—à–∫–∏ |
| `enable secret class123` | –ó–∞–¥–∞–≤–∞ **—à–∏—Ñ—Ä–æ–≤–∞–Ω–∞** –ø–∞—Ä–æ–ª–∞ –∑–∞ privileged mode | –ó–∞—â–∏—Ç–∞ –Ω–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ—Ç–æ (enable = –≤–ª–∏–∑–∞–Ω–µ –≤ —Ä–µ–∂–∏–º –Ω–∞ –∞–¥–º–∏–Ω–∏—Å—Ç—Ä–∞—Ç–æ—Ä) | –ü—Ä–∏ `enable` —â–µ –ø–∏—Ç–∞ –∑–∞ –ø–∞—Ä–æ–ª–∞ |
| `line console 0` | –í–ª–∏–∑–∞ –≤ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ **–∫–æ–Ω–∑–æ–ª–Ω–∞—Ç–∞ –ª–∏–Ω–∏—è** (—Ñ–∏–∑–∏—á–µ—Å–∫–æ—Ç–æ —Å–≤—ä—Ä–∑–≤–∞–Ω–µ) | –ó–∞ –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ –Ω–∞ –¥–æ—Å—Ç—ä–ø–∞ –ø—Ä–µ–∑ –∫–æ–Ω–∑–æ–ª–Ω–∏—è –ø–æ—Ä—Ç | Prompt —Å—Ç–∞–≤–∞ `R1(config-line)#` |
| `password cisco` | –ó–∞–¥–∞–≤–∞ –ø–∞—Ä–æ–ª–∞ –∑–∞ –∫–æ–Ω–∑–æ–ª–µ–Ω –¥–æ—Å—Ç—ä–ø | –ó–∞—â–∏—Ç–∞ –ø—Ä–∏ –¥–∏—Ä–µ–∫—Ç–µ–Ω —Ñ–∏–∑–∏—á–µ—Å–∫–∏ –¥–æ—Å—Ç—ä–ø | –ü—Ä–∏ –≤–ª–∏–∑–∞–Ω–µ —â–µ –ø–∏—Ç–∞ –∑–∞ "cisco" |
| `login` | **–ê–∫—Ç–∏–≤–∏—Ä–∞** –ø—Ä–æ–≤–µ—Ä–∫–∞—Ç–∞ –∑–∞ –ø–∞—Ä–æ–ª–∞ | –ë–µ–∑ —Ç–æ–≤–∞, –ø–∞—Ä–æ–ª–∞—Ç–∞ –Ω—è–º–∞ –¥–∞ —Å–µ –∏–∑–∏—Å–∫–≤–∞! | –©–µ –∏–∑–∏—Å–∫–≤–∞ –ø–∞—Ä–æ–ª–∞ –ø—Ä–∏ login |
| `logging synchronous` | –°–∏–Ω—Ö—Ä–æ–Ω–∏–∑–∏—Ä–∞ log —Å—ä–æ–±—â–µ–Ω–∏—è—Ç–∞ | –ü—Ä–µ–¥–æ—Ç–≤—Ä–∞—Ç—è–≤–∞ –ø—Ä–µ–∫—ä—Å–≤–∞–Ω–µ –Ω–∞ –∫–æ–º–∞–Ω–¥–∏—Ç–µ –æ—Ç —Å–∏—Å—Ç–µ–º–Ω–∏ —Å—ä–æ–±—â–µ–Ω–∏—è | –ü–æ-—á–∏—Å—Ç–æ –ø–∏—Å–∞–Ω–µ –≤ CLI |
| `exit` | –ò–∑–ª–∏–∑–∞ –æ—Ç —Ç–µ–∫—É—â–∏—è —Ä–µ–∂–∏–º | –í—Ä—ä—â–∞ –∫—ä–º –≥–æ—Ä–Ω–æ—Ç–æ –Ω–∏–≤–æ | `R1(config-line)#` ‚Üí `R1(config)#` |

---

### –†–µ–∂–∏–º–∏ –Ω–∞ —Ä–∞–±–æ—Ç–∞ (–≤–∞–∂–Ω–æ!):

```
Router>                      ‚Üê User EXEC mode (–æ–≥—Ä–∞–Ω–∏—á–µ–Ω)
  ‚Üì enable
Router#                      ‚Üê Privileged EXEC mode (–ø—ä–ª–µ–Ω –¥–æ—Å—Ç—ä–ø)
  ‚Üì configure terminal
Router(config)#              ‚Üê Global Configuration mode
  ‚Üì interface GigE0/0
Router(config-if)#           ‚Üê Interface Configuration mode
  ‚Üì exit
Router(config)#              
  ‚Üì exit
Router#
  ‚Üì exit (or logout)
Router>
```

**–ö–ª–∞–≤–∏—à–Ω–∏ –∫–æ–º–±–∏–Ω–∞—Ü–∏–∏:**
- `Ctrl+C` ‚Üí –ü—Ä–µ–∫—ä—Å–≤–∞–Ω–µ –Ω–∞ –∫–æ–º–∞–Ω–¥–∞
- `Ctrl+Z` ‚Üí –î–∏—Ä–µ–∫—Ç–µ–Ω –∏–∑—Ö–æ–¥ –∫—ä–º privileged mode
- `exit` ‚Üí –ï–¥–Ω–æ –Ω–∏–≤–æ –Ω–∞–∑–∞–¥
- `end` ‚Üí –î–∏—Ä–µ–∫—Ç–Ω–æ –∫—ä–º privileged mode

---

### –°—Ç—ä–ø–∫–∞ 3: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞

```cisco
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# description Connection to SW1
R1(config-if)# no shutdown
R1(config-if)# exit
```

**–î–µ—Ç–∞–π–ª–Ω–æ –æ–±—è—Å–Ω–µ–Ω–∏–µ:**

| –ö–æ–º–∞–Ω–¥–∞ | –ö–∞–∫–≤–æ –ø—Ä–∞–≤–∏ | –ê–Ω–∞–ª–æ–≥–∏—è | –î–æ–ø—ä–ª–Ω–∏—Ç–µ–ª–Ω–æ |
|---------|-------------|----------|--------------|
| `interface GigabitEthernet0/0` | –í–ª–∏–∑–∞ –≤ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–µ–Ω –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å | –ö–∞—Ç–æ –æ—Ç–≤–∞—Ä—è—à –Ω–∞—Å—Ç—Ä–æ–π–∫–∏—Ç–µ –Ω–∞ –º—Ä–µ–∂–æ–≤–∞ –∫–∞—Ä—Ç–∞ –≤ Windows | –§–æ—Ä–º–∞—Ç: `type slot/port` (GigE **0/0** = slot 0, port 0) |
| `ip address 192.168.1.1 255.255.255.0` | –ó–∞–¥–∞–≤–∞ IP –∞–¥—Ä–µ—Å –∏ subnet mask | –ö–∞—Ç–æ –∑–∞–¥–∞–≤–∞—à IP –Ω–∞ –º—Ä–µ–∂–æ–≤–∞ –∫–∞—Ä—Ç–∞ | **192.168.1.1** = gateway (–æ–±–∏–∫–Ω–æ–≤–µ–Ω–æ .1), **/24** = 255.255.255.0 |
| `description Connection to SW1` | –î–æ–±–∞–≤—è –æ–ø–∏—Å–∞–Ω–∏–µ –Ω–∞ –ø–æ—Ä—Ç–∞ | –ö–∞—Ç–æ –µ—Ç–∏–∫–µ—Ç "–ö—ä–º Switch SW1" | –ù–µ –µ –∑–∞–¥—ä–ª–∂–∏—Ç–µ–ª–Ω–æ, –Ω–æ –ø–æ–º–∞–≥–∞ –ø—Ä–∏ troubleshooting |
| `no shutdown` | **–ê–∫—Ç–∏–≤–∏—Ä–∞** –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞ | –ö–∞—Ç–æ "–≤–∫–ª—é—á–≤–∞–Ω–µ" –Ω–∞ –º—Ä–µ–∂–æ–≤–∞—Ç–∞ –∫–∞—Ä—Ç–∞ | **–ú–ù–û–ì–û –í–ê–ñ–ù–û!** –ü–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏—Ç–µ –Ω–∞ router —Å–∞ **shutdown** |
| `exit` | –ò–∑–ª–∏–∑–∞ –æ—Ç interface —Ä–µ–∂–∏–º | –í—Ä—ä—â–∞–Ω–µ –Ω–∞–∑–∞–¥ | Prompt: `R1(config-if)#` ‚Üí `R1(config)#` |

---

### –ó–∞—â–æ `no shutdown` –µ –ö–†–ò–¢–ò–ß–ù–û –≤–∞–∂–Ω–∞ –∫–æ–º–∞–Ω–¥–∞?

**Cisco router –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏—Ç–µ —Å–∞ shutdown –ø–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ!**

```
–ë–µ–∑ no shutdown:
R1# show ip interface brief
GigabitEthernet0/0  192.168.1.1  YES manual administratively down  down
                                         ‚Üë
                                    SHUTDOWN! ‚ùå

–° no shutdown:
R1# show ip interface brief
GigabitEthernet0/0  192.168.1.1  YES manual up                    up
                                         ‚Üë
                                    ACTIVE! ‚úÖ
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** Switch –ø–æ—Ä—Ç–æ–≤–µ—Ç–µ —Å–∞ **up** –ø–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ (–æ–±—Ä–∞—Ç–Ω–æ—Ç–æ –Ω–∞ router)

---

### –°—Ç—ä–ø–∫–∞ 4: –ó–∞–ø–∏—Å–≤–∞–Ω–µ –Ω–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞

```cisco
R1(config)# exit
R1# copy running-config startup-config
Destination filename [startup-config]? [Enter]
Building configuration...
[OK]
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ:**

| –¢–µ—Ä–º–∏–Ω | –ö–∞–∫–≤–æ –µ | –ö—ä–¥–µ —Å–µ –Ω–∞–º–∏—Ä–∞ | –ö–∞–∫–≤–æ —Å—Ç–∞–≤–∞ –ø—Ä–∏ restart |
|--------|---------|----------------|-------------------------|
| **running-config** | –ê–∫—Ç–∏–≤–Ω–∞—Ç–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –í –ú–û–ú–ï–ù–¢–ê | RAM (–≤—Ä–µ–º–µ–Ω–Ω–∞ –ø–∞–º–µ—Ç) | ‚ùå **–ò–ó–ì–£–ë–í–ê –°–ï** –ø—Ä–∏ restart |
| **startup-config** | –ó–∞–ø–∞–∑–µ–Ω–∞—Ç–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è | NVRAM (–ø–æ—Å—Ç–æ—è–Ω–Ω–∞ –ø–∞–º–µ—Ç) | ‚úÖ **–û–°–¢–ê–í–ê** —Å–ª–µ–¥ restart |

**–ê–Ω–∞–ª–æ–≥–∏—è:**
- `running-config` = Word –¥–æ–∫—É–º–µ–Ω—Ç –ø—Ä–µ–¥–∏ –¥–∞ –Ω–∞—Ç–∏—Å–Ω–µ—à Save
- `startup-config` = Word –¥–æ–∫—É–º–µ–Ω—Ç —Å–ª–µ–¥ Save (–Ω–∞ –¥–∏—Å–∫–∞)

**–ö—Ä–∞—Ç–∫–∞ –∫–æ–º–∞–Ω–¥–∞:**
```cisco
R1# wr           ‚Üê –°—ä–∫—Ä–∞—â–µ–Ω–∏–µ –∑–∞ write (—Å—ä—â–æ—Ç–æ –∫–∞—Ç–æ copy run start)
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞ –¥–∞–ª–∏ –µ –∑–∞–ø–∞–∑–µ–Ω–∞:**
```cisco
R1# show startup-config     ‚Üê –í–∏–∂—Ç–µ –∫–∞–∫–≤–æ —â–µ —Å–µ –∑–∞—Ä–µ–¥–∏ –ø—Ä–∏ restart
```

---

## –ß–ê–°–¢ 3: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ Switch (20 –º–∏–Ω)

### –°—Ç—ä–ø–∫–∞ 1: –ë–∞–∑–æ–≤–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è

```cisco
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW1
SW1(config)# no ip domain-lookup
SW1(config)# enable secret class123
SW1(config)# line console 0
SW1(config-line)# password cisco
SW1(config-line)# login
SW1(config-line)# logging synchronous
SW1(config-line)# exit
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** –ö–æ–º–∞–Ω–¥–∏—Ç–µ —Å–∞ –°–™–©–ò–¢–ï –∫–∞—Ç–æ –ø—Ä–∏ Router-–∞!

**–ó–∞—â–æ Switch —Å—ä—â–æ –∏–º–∞ hostname –∏ –ø–∞—Ä–æ–ª–∏?**
- –ó–∞ **security** (–∑–∞—â–∏—Ç–∞ –Ω–∞ –¥–æ—Å—Ç—ä–ø–∞)
- –ó–∞ **management** (–∞–¥–º–∏–Ω–∏—Å—Ç—Ä–∏—Ä–∞–Ω–µ)
- –ó–∞ **–∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ü–∏—è** (–¥–∞ –∑–Ω–∞–µ—à –∫–æ–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞—à)

---

### –°—Ç—ä–ø–∫–∞ 2: VLAN 1 management –∞–¥—Ä–µ—Å

```cisco
SW1(config)# interface vlan 1
SW1(config-if)# ip address 192.168.1.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit
```

**–ö–∞–∫–≤–æ –µ VLAN 1?**

| –¢–µ—Ä–º–∏–Ω | –û–±—è—Å–Ω–µ–Ω–∏–µ |
|--------|-----------|
| **VLAN** | Virtual LAN (–≤–∏—Ä—Ç—É–∞–ª–Ω–∞ –ª–æ–∫–∞–ª–Ω–∞ –º—Ä–µ–∂–∞) |
| **VLAN 1** | **Default VLAN** - –≤—Å–∏—á–∫–∏ –ø–æ—Ä—Ç–æ–≤–µ –Ω–∞ switch-–∞ —Å–∞ —Ç—É–∫ –ø–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ |
| **interface vlan 1** | **SVI (Switch Virtual Interface)** - –≤–∏—Ä—Ç—É–∞–ª–µ–Ω –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å –∑–∞ —É–ø—Ä–∞–≤–ª–µ–Ω–∏–µ –Ω–∞ switch-–∞ |

**–ó–∞—â–æ switch-—ä—Ç –∏–º–∞ –Ω—É–∂–¥–∞ –æ—Ç IP –∞–¥—Ä–µ—Å?**

Switch —Ä–∞–±–æ—Ç–∏ –Ω–∞ **Layer 2** (MAC –∞–¥—Ä–µ—Å–∏), –Ω–æ –∑–∞ **remote management** (Telnet, SSH, web interface) –∏–º–∞ –Ω—É–∂–¥–∞ –æ—Ç **IP –∞–¥—Ä–µ—Å**.

```
–ë–µ–∑ IP –∞–¥—Ä–µ—Å:
- Switch —Ä–∞–±–æ—Ç–∏ (—Ñ–æ—Ä–≤–∞—Ä–¥–≤–∞ —Ç—Ä–∞—Ñ–∏–∫) ‚úÖ
- –ù–ï –º–æ–∂–µ—à –¥–∞ –≥–æ —É–ø—Ä–∞–≤–ª—è–≤–∞—à –æ—Ç–¥–∞–ª–µ—á–µ–Ω–æ ‚ùå

–° IP –∞–¥—Ä–µ—Å:
- Switch —Ä–∞–±–æ—Ç–∏ ‚úÖ
- –ú–æ–∂–µ—à SSH/Telnet –∫—ä–º –Ω–µ–≥–æ ‚úÖ
- –ú–æ–∂–µ—à –¥–∞ –≥–æ ping-–Ω–µ—à ‚úÖ
```

**–í–∞–∂–Ω–æ:** IP –∞–¥—Ä–µ—Å—ä—Ç –Ω–∞ switch-–∞ —Ç—Ä—è–±–≤–∞ –¥–∞ –µ –≤ **—Å—ä—â–∞—Ç–∞ –º—Ä–µ–∂–∞** –∫–∞—Ç–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ç–∞!

```
Router:  192.168.1.1  ‚úÖ
Switch:  192.168.1.2  ‚úÖ
PC1:     192.168.1.10 ‚úÖ

Switch:  10.0.0.1     ‚ùå –†–∞–∑–ª–∏—á–Ω–∞ –º—Ä–µ–∂–∞! –ù—è–º–∞ –¥–∞ —Ä–∞–±–æ—Ç–∏!
```

---

### –°—Ç—ä–ø–∫–∞ 3: Default gateway

```cisco
SW1(config)# ip default-gateway 192.168.1.1
```

**–ö–∞–∫–≤–æ –ø—Ä–∞–≤–∏ `ip default-gateway`?**

**Default gateway** –µ "–∏–∑—Ö–æ–¥—ä—Ç" –∫—ä–º –¥—Ä—É–≥–∏ –º—Ä–µ–∂–∏.

```
–°—Ü–µ–Ω–∞—Ä–∏–π: –¢—Ä—è–±–≤–∞ –¥–∞ update-–Ω–µ—à switch-–∞ –æ—Ç –∏–Ω—Ç–µ—Ä–Ω–µ—Ç

SW1 (192.168.1.2) –∏—Å–∫–∞ –¥–∞ –¥–æ—Å—Ç–∏–≥–Ω–µ Update Server (8.8.8.8):
  ‚Üì
"8.8.8.8 –Ω–µ –µ –≤ –º–æ—è—Ç–∞ –º—Ä–µ–∂–∞ (192.168.1.0/24)"
  ‚Üì
"–ò–∑–ø—Ä–∞—â–∞–º –∫—ä–º default gateway: 192.168.1.1"
  ‚Üì
Router (192.168.1.1) –ø–æ–ª—É—á–∞–≤–∞ –ø–∞–∫–µ—Ç–∞
  ‚Üì
Router –≥–æ –∏–∑–ø—Ä–∞—â–∞ –∫—ä–º –∏–Ω—Ç–µ—Ä–Ω–µ—Ç
```

**–ë–µ–∑ default gateway:**
```
SW1 –º–æ–∂–µ –¥–∞ –¥–æ—Å—Ç—ä–ø–∏ —Å–∞–º–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –≤ 192.168.1.0/24 ‚ùå
```

**–° default gateway:**
```
SW1 –º–æ–∂–µ –¥–∞ –¥–æ—Å—Ç—ä–ø–∏ –≤—Å—è–∫—ä–¥–µ (–ø—Ä–µ–∑ router-–∞) ‚úÖ
```

---

### –°—Ç—ä–ø–∫–∞ 4: –û–ø–∏—Å–∞–Ω–∏–µ –Ω–∞ –ø–æ—Ä—Ç–æ–≤–µ

```cisco
SW1(config)# interface FastEthernet0/1
SW1(config-if)# description Connection to R1
SW1(config-if)# exit
!
SW1(config)# interface FastEthernet0/2
SW1(config-if)# description PC1
SW1(config-if)# exit
!
SW1(config)# interface FastEthernet0/3
SW1(config-if)# description PC2
SW1(config-if)# exit
!
SW1(config)# interface FastEthernet0/4
SW1(config-if)# description PC3
SW1(config-if)# exit
```

**–ó–∞—â–æ –¥–∞ –¥–æ–±–∞–≤—è—à description?**

```
–ë–µ–∑ description:
SW1# show interfaces status
Port      Status       Vlan
Fa0/1     connected    1
Fa0/2     connected    1
Fa0/3     connected    1
         ‚Üë
    –ö–æ–π –∫–∞–±–µ–ª –∫—ä–¥–µ –æ—Ç–∏–≤–∞? ü§î

–° description:
SW1# show interfaces status
Port      Name                  Status       Vlan
Fa0/1     Connection to R1      connected    1
Fa0/2     PC1                   connected    1
Fa0/3     PC2                   connected    1
         ‚Üë
    –Ø—Å–Ω–æ! ‚úÖ
```

**Best practice:** –í–ò–ù–ê–ì–ò –¥–æ–±–∞–≤—è–π descriptions!
- –ü–æ–º–∞–≥–∞ –ø—Ä–∏ troubleshooting
- –î–æ–±—Ä–∞ –¥–æ–∫—É–º–µ–Ω—Ç–∞—Ü–∏—è
- –°–ø–µ—Å—Ç—è–≤–∞ –≤—Ä–µ–º–µ

**–°–∏–Ω—Ç–∞–∫—Å–∏—Å:**
```cisco
description [text –¥–æ 240 —Å–∏–º–≤–æ–ª–∞]
```

---

### –°—Ç—ä–ø–∫–∞ 5: –ó–∞–ø–∏—Å–≤–∞–Ω–µ

```cisco
SW1(config)# exit
SW1# copy running-config startup-config
```

**–ò–ª–∏ –∫—Ä–∞—Ç–∫–æ:**
```cisco
SW1# wr
```

---

## –ß–ê–°–¢ 4: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ PC-—Ç–∞ (10 –º–∏–Ω)

### –ö–∞–∫ –¥–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞—Ç–µ IP –∞–¥—Ä–µ—Å –Ω–∞ PC:

1. –ö–ª–∏–∫–Ω–µ—Ç–µ –Ω–∞ **PC** –∏–∫–æ–Ω–∞
2. –ò–∑–±–µ—Ä–µ—Ç–µ —Ç–∞–± **Desktop**
3. –ö–ª–∏–∫–Ω–µ—Ç–µ –Ω–∞ **IP Configuration**
4. –ò–∑–±–µ—Ä–µ—Ç–µ **Static** (–Ω–µ DHCP)
5. –í—ä–≤–µ–¥–µ—Ç–µ –∞–¥—Ä–µ—Å–∏—Ç–µ

---

### –ê–¥—Ä–µ—Å–Ω–∞ —Ç–∞–±–ª–∏—Ü–∞:

| Device | Interface | IP Address | Subnet Mask | Default Gateway |
|--------|-----------|------------|-------------|-----------------|
| R1 | GigE0/0 | 192.168.1.1 | 255.255.255.0 | N/A |
| SW1 | VLAN 1 | 192.168.1.2 | 255.255.255.0 | 192.168.1.1 |
| PC1 | NIC | 192.168.1.10 | 255.255.255.0 | 192.168.1.1 |
| PC2 | NIC | 192.168.1.11 | 255.255.255.0 | 192.168.1.1 |
| PC3 | NIC | 192.168.1.12 | 255.255.255.0 | 192.168.1.1 |

---

### –ó–∞ –≤—Å–µ–∫–∏ PC (Desktop ‚Üí IP Configuration):

**PC1:**
- IP Address: `192.168.1.10`
- Subnet Mask: `255.255.255.0`
- Default Gateway: `192.168.1.1`

**PC2:**
- IP Address: `192.168.1.11`
- Subnet Mask: `255.255.255.0`
- Default Gateway: `192.168.1.1`

**PC3:**
- IP Address: `192.168.1.12`
- Subnet Mask: `255.255.255.0`
- Default Gateway: `192.168.1.1`

**–í–∞–∂–Ω–æ:**
- **Subnet Mask** —Ç—Ä—è–±–≤–∞ –¥–∞ –µ –µ–¥–Ω–∞–∫–≤–∞ –∑–∞ –≤—Å–∏—á–∫–∏ (255.255.255.0)
- **Default Gateway** –µ –≤–∏–Ω–∞–≥–∏ IP-—Ç–æ –Ω–∞ Router-–∞ (192.168.1.1)
- **IP –∞–¥—Ä–µ—Å–∏—Ç–µ** —Ç—Ä—è–±–≤–∞ –¥–∞ —Å–∞ —É–Ω–∏–∫–∞–ª–Ω–∏ (–Ω—è–º–∞ –¥–≤–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ —Å –µ–¥–∏–Ω IP)

---

### –ö–∞–∫–≤–æ –æ–∑–Ω–∞—á–∞–≤–∞—Ç –∞–¥—Ä–µ—Å–∏—Ç–µ?

```
192.168.1.10
‚îÇ   ‚îÇ   ‚îÇ ‚îÇ
‚îÇ   ‚îÇ   ‚îÇ ‚îî‚îÄ Host —á–∞—Å—Ç (—É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ) - –º–æ–∂–µ –¥–∞ –µ –æ—Ç .1 –¥–æ .254
‚îÇ   ‚îÇ   ‚îî‚îÄ‚îÄ‚îÄ Subnet (–ø–æ–¥–º—Ä–µ–∂–∞) - –≤—Å–∏—á–∫–∏ —Å–∞ –≤ .1
‚îÇ   ‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ Network (–º—Ä–µ–∂–∞) - –≤—Å–∏—á–∫–∏ —Å–∞ –≤ 168
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ Private Class C network
```

**–ó–∞—â–æ –≤—Å–∏—á–∫–∏ —Å–∞ 192.168.1.X?**
- –ó–∞—â–æ—Ç–æ —Å–∞ –≤ **–ï–î–ù–ê –º—Ä–µ–∂–∞** (same subnet)
- Subnet mask 255.255.255.0 –æ–∑–Ω–∞—á–∞–≤–∞ –ø—ä—Ä–≤–∏—Ç–µ 3 –æ–∫—Ç–µ—Ç–∞ —Å–∞ –º—Ä–µ–∂–∞

**–ó–∞—â–æ gateway –µ .1?**
- Convention (—Ç—Ä–∞–¥–∏—Ü–∏—è): –ø—ä—Ä–≤–∏—è—Ç –∞–¥—Ä–µ—Å (.1) –µ –∑–∞ gateway
- –ú–æ–∂–µ –¥–∞ –µ –∏ –¥—Ä—É–≥ (–Ω–∞–ø—Ä. .254), –Ω–æ .1 –µ —Å—Ç–∞–Ω–¥–∞—Ä—Ç

---

## –ß–ê–°–¢ 5: –¢–µ—Å—Ç–≤–∞–Ω–µ –Ω–∞ —Å–≤—ä—Ä–∑–∞–Ω–æ—Å—Ç—Ç–∞ (15 –º–∏–Ω)

### Test 1: Ping –æ—Ç PC1 –¥–æ Router

1. –ö–ª–∏–∫–Ω–µ—Ç–µ –Ω–∞ **PC1**
2. –ò–∑–±–µ—Ä–µ—Ç–µ —Ç–∞–± **Desktop**
3. –ö–ª–∏–∫–Ω–µ—Ç–µ –Ω–∞ **Command Prompt**
4. –ù–∞–ø–∏—à–µ—Ç–µ:

```
C:\> ping 192.168.1.1
```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:**
```
Pinging 192.168.1.1 with 32 bytes of data:

Reply from 192.168.1.1: bytes=32 time<1ms TTL=255
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255

Ping statistics for 192.168.1.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss)
```

**–£—Å–ø–µ—à–µ–Ω ping! ‚úÖ**

---

### –ö–∞–∫–≤–æ –æ–∑–Ω–∞—á–∞–≤–∞ ping —Ä–µ–∑—É–ª—Ç–∞—Ç—ä—Ç?

| –ü–∞—Ä–∞–º–µ—Ç—ä—Ä | –ó–Ω–∞—á–µ–Ω–∏–µ | –ö–∞–∫–≤–æ –æ–∑–Ω–∞—á–∞–≤–∞ |
|-----------|----------|----------------|
| **bytes=32** | –†–∞–∑–º–µ—Ä –Ω–∞ –ø–∞–∫–µ—Ç–∞ | –°—Ç–∞–Ω–¥–∞—Ä—Ç–µ–Ω ICMP echo request |
| **time<1ms** | –í—Ä–µ–º–µ –∑–∞ –æ—Ç–≥–æ–≤–æ—Ä | –ú–Ω–æ–≥–æ –±—ä—Ä–∑–æ (–ª–æ–∫–∞–ª–Ω–∞ –º—Ä–µ–∂–∞) |
| **TTL=255** | Time To Live | –ö–æ–ª–∫–æ "—Å–∫–æ–∫–∞" (hops) –º–æ–∂–µ –¥–∞ –Ω–∞–ø—Ä–∞–≤–∏ –ø–∞–∫–µ—Ç—ä—Ç |
| **Lost = 0** | –ó–∞–≥—É–±–µ–Ω–∏ –ø–∞–∫–µ—Ç–∏ | **0% = –æ—Ç–ª–∏—á–Ω–æ!** |

**–ê–∫–æ –ø—ä—Ä–≤–∏—è—Ç ping –µ "Request timed out":**
```
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255  ‚úÖ
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255  ‚úÖ
Reply from 192.168.1.1: bytes=32 time<1ms TTL=255  ‚úÖ
Request timed out.                                  ‚ö†Ô∏è –ü—ä—Ä–≤–∏—è—Ç

–¢–æ–≤–∞ –µ –ù–û–†–ú–ê–õ–ù–û! ‚úÖ
```

**–ó–∞—â–æ?** ARP resolution (switch-—ä—Ç —Ç—Ä—è–±–≤–∞ –¥–∞ "–Ω–∞—É—á–∏" MAC –∞–¥—Ä–µ—Å–∞)

---

### Test 2: Ping –º–µ–∂–¥—É PC-—Ç–∞

```
–û—Ç PC1:
C:\> ping 192.168.1.11
C:\> ping 192.168.1.12
```

**–¢—Ä—è–±–≤–∞ –∏ –¥–≤–∞—Ç–∞ –¥–∞ —Ä–∞–±–æ—Ç—è—Ç!**

**–ö–∞–∫–≤–æ —Å–µ —Å–ª—É—á–≤–∞ –ø—Ä–∏ ping –æ—Ç PC1 ‚Üí PC2:**

```
1. PC1 –∏–∑–ø—Ä–∞—â–∞ ICMP Echo Request
   ‚îî‚îÄ Destination IP: 192.168.1.11
   ‚îî‚îÄ Destination MAC: ? (–Ω–µ –∑–Ω–∞–µ –æ—â–µ)

2. PC1 –∏–∑–ø—Ä–∞—â–∞ ARP Request (broadcast):
   "–ö–æ–π –∏–º–∞ IP 192.168.1.11? –ö–∞–∂–µ—Ç–µ –º–∏ MAC –∞–¥—Ä–µ—Å–∞!"
   ‚îî‚îÄ Switch —Ñ–æ—Ä–≤–∞—Ä–¥–≤–∞ –Ω–∞ –≤—Å–∏—á–∫–∏ –ø–æ—Ä—Ç–æ–≤–µ

3. PC2 –ø–æ–ª—É—á–∞–≤–∞ ARP Request:
   "–ê–∑ —Å—ä–º 192.168.1.11! –ú–æ—è—Ç MAC –µ: AA:BB:CC:DD:EE:FF"
   ‚îî‚îÄ Switch "–Ω–∞—É—á–∞–≤–∞" MAC –∞–¥—Ä–µ—Å–∞ –Ω–∞ PC2

4. PC1 –ø–æ–ª—É—á–∞–≤–∞ ARP Reply:
   –í–µ—á–µ –∑–Ω–∞–µ MAC –∞–¥—Ä–µ—Å–∞ ‚Üí –∏–∑–ø—Ä–∞—â–∞ ICMP Echo Request
   ‚îî‚îÄ Switch —Ñ–æ—Ä–≤–∞—Ä–¥–≤–∞ –¥–∏—Ä–µ–∫—Ç–Ω–æ –Ω–∞ PC2 (–∑–Ω–∞–µ MAC-–∞)

5. PC2 –∏–∑–ø—Ä–∞—â–∞ ICMP Echo Reply
   ‚îî‚îÄ Switch —Ñ–æ—Ä–≤–∞—Ä–¥–≤–∞ –Ω–∞ PC1

6. PC1 –ø–æ–ª—É—á–∞–≤–∞ –æ—Ç–≥–æ–≤–æ—Ä: "Reply from 192.168.1.11"
```

---

### Test 3: Ping –æ—Ç Router –¥–æ PC

```
R1# ping 192.168.1.10

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/1 ms
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ –Ω–∞ —Ä–µ–∑—É–ª—Ç–∞—Ç–∞:**

| –°–∏–º–≤–æ–ª | –ó–Ω–∞—á–µ–Ω–∏–µ |
|--------|----------|
| `!` | –£—Å–ø–µ—à–µ–Ω –æ—Ç–≥–æ–≤–æ—Ä ‚úÖ |
| `.` | Timeout (–Ω—è–º–∞ –æ—Ç–≥–æ–≤–æ—Ä) ‚ùå |
| `U` | Destination unreachable ‚ùå |
| `Q` | Source quench (congestion) ‚ö†Ô∏è |
| `?` | –ù–µ–∏–∑–≤–µ—Å—Ç–µ–Ω –ø–∞–∫–µ—Ç ‚ùì |

**–ü—Ä–∏–º–µ—Ä –Ω–∞ –Ω–µ—É—Å–ø–µ—à–µ–Ω ping:**
```
R1# ping 192.168.1.99
.....
Success rate is 0 percent (0/5)
```

---

### Test 4: –ü—Ä–æ–≤–µ—Ä–∫–∞ –Ω–∞ ARP —Ç–∞–±–ª–∏—Ü–∞—Ç–∞

```
R1# show arp
```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:**
```
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  192.168.1.1            -    0011.1111.1111  ARPA   GigabitEthernet0/0
Internet  192.168.1.2            0    0022.2222.2222  ARPA   GigabitEthernet0/0
Internet  192.168.1.10           0    0033.3333.3333  ARPA   GigabitEthernet0/0
Internet  192.168.1.11           0    0044.4444.4444  ARPA   GigabitEthernet0/0
Internet  192.168.1.12           0    0055.5555.5555  ARPA   GigabitEthernet0/0
```

**–ö–∞–∫–≤–æ –µ ARP —Ç–∞–±–ª–∏—Ü–∞?**

**ARP (Address Resolution Protocol)** —Å–≤—ä—Ä–∑–≤–∞ **IP –∞–¥—Ä–µ—Å–∏** —Å **MAC –∞–¥—Ä–µ—Å–∏**.

```
–ü—Ä–æ–±–ª–µ–º: 
Router –∑–Ω–∞–µ IP –∞–¥—Ä–µ—Å–∞ (192.168.1.10)
–ù–æ Ethernet frames —Å–µ –∏–∑–ø—Ä–∞—â–∞—Ç –∫—ä–º MAC –∞–¥—Ä–µ—Å–∏!

–†–µ—à–µ–Ω–∏–µ:
ARP —Ç–∞–±–ª–∏—Ü–∞: "192.168.1.10 = MAC 00:33:33:33:33:33"
```

**–ê–Ω–∞–ª–æ–≥–∏—è:** ARP —Ç–∞–±–ª–∏—Ü–∞—Ç–∞ –µ –∫–∞—Ç–æ —Ç–µ–ª–µ—Ñ–æ–Ω–µ–Ω —É–∫–∞–∑–∞—Ç–µ–ª
- IP –∞–¥—Ä–µ—Å = –ò–º–µ –Ω–∞ —á–æ–≤–µ–∫–∞
- MAC –∞–¥—Ä–µ—Å = –¢–µ–ª–µ—Ñ–æ–Ω–µ–Ω –Ω–æ–º–µ—Ä

---

## –ß–ê–°–¢ 6: –í–µ—Ä–∏—Ñ–∏–∫–∞—Ü–∏–æ–Ω–Ω–∏ –∫–æ–º–∞–Ω–¥–∏ (10 –º–∏–Ω)

### –ù–∞ Router:

#### 1. `show ip interface brief`

```cisco
R1# show ip interface brief
```

**–ü–æ–∫–∞–∑–≤–∞:**
```
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     192.168.1.1     YES manual up                    up
GigabitEthernet0/1     unassigned      YES unset  administratively down down
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ –Ω–∞ –∫–æ–ª–æ–Ω–∏—Ç–µ:**

| –ö–æ–ª–æ–Ω–∞ | –ó–Ω–∞—á–µ–Ω–∏–µ | –ü—Ä–∏–º–µ—Ä |
|--------|----------|--------|
| **Interface** | –ò–º–µ –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞ | GigabitEthernet0/0 |
| **IP-Address** | IP –∞–¥—Ä–µ—Å (–∏–ª–∏ unassigned) | 192.168.1.1 |
| **OK?** | –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ –≤–∞–ª–∏–¥–Ω–∞ –ª–∏ –µ | YES = –¥–æ–±—Ä–µ |
| **Method** | –ö–∞–∫ –µ –ø–æ–ª—É—á–µ–Ω IP-—ä—Ç | manual = —Ä—ä—á–Ω–æ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–Ω |
| **Status** | –§–∏–∑–∏—á–µ—Å–∫–æ —Å—ä—Å—Ç–æ—è–Ω–∏–µ (Layer 1) | **up** = –∫–∞–±–µ–ª —Å–≤—ä—Ä–∑–∞–Ω ‚úÖ |
| **Protocol** | –õ–æ–≥–∏—á–µ—Å–∫–æ —Å—ä—Å—Ç–æ—è–Ω–∏–µ (Layer 2) | **up** = –ø—Ä–æ—Ç–æ–∫–æ–ª—ä—Ç —Ä–∞–±–æ—Ç–∏ ‚úÖ |

**–ö–æ–º–±–∏–Ω–∞—Ü–∏–∏ Status/Protocol:**

| Status | Protocol | –ó–Ω–∞—á–µ–Ω–∏–µ |
|--------|----------|----------|
| **up** | **up** | –†–∞–±–æ—Ç–∏ –ø–µ—Ä—Ñ–µ–∫—Ç–Ω–æ ‚úÖ |
| **up** | **down** | –ö–∞–±–µ–ª —Å–≤—ä—Ä–∑–∞–Ω, –Ω–æ –ø—Ä–æ—Ç–æ–∫–æ–ª –Ω–µ —Ä–∞–±–æ—Ç–∏ ‚ö†Ô∏è |
| **down** | **down** | –ù—è–º–∞ –∫–∞–±–µ–ª ‚ùå |
| **administratively down** | **down** | –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å –µ **shutdown** ‚ùå |

---

#### 2. `show running-config`

```cisco
R1# show running-config
```

**–ü–æ–∫–∞–∑–≤–∞ –¶–Ø–õ–ê–¢–ê –∞–∫—Ç–∏–≤–Ω–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è.**

**–ü–æ–ª–µ–∑–Ω–∏ —Å–µ–∫—Ü–∏–∏:**
```
hostname R1                          ‚Üê Hostname
!
interface GigabitEthernet0/0         ‚Üê –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å –∫–æ–Ω—Ñ–∏–≥
 ip address 192.168.1.1 255.255.255.0
 description Connection to SW1
 no shutdown
!
line console 0                       ‚Üê –ö–æ–Ω–∑–æ–ª–∞ –∫–æ–Ω—Ñ–∏–≥
 password cisco
 login
 logging synchronous
!
```

---

#### 3. `show ip route`

```cisco
R1# show ip route
```

**–ü–æ–∫–∞–∑–≤–∞ routing —Ç–∞–±–ª–∏—Ü–∞—Ç–∞:**
```
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP

C    192.168.1.0/24 is directly connected, GigabitEthernet0/0
```

**–ö–∞–∫–≤–æ –æ–∑–Ω–∞—á–∞–≤–∞:**
- `C` = **Connected route** (–¥–∏—Ä–µ–∫—Ç–Ω–æ —Å–≤—ä—Ä–∑–∞–Ω–∞ –º—Ä–µ–∂–∞)
- `192.168.1.0/24` = –ú—Ä–µ–∂–∞—Ç–∞
- `GigabitEthernet0/0` = –ü—Ä–µ–∑ –∫–æ–π –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å

---

### –ù–∞ Switch:

#### 1. `show ip interface brief`

```cisco
SW1# show ip interface brief
```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:**
```
Interface              IP-Address      OK? Method Status                Protocol
Vlan1                  192.168.1.2     YES manual up                    up
FastEthernet0/1        unassigned      YES unset  up                    up
FastEthernet0/2        unassigned      YES unset  up                    up
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** Switch –ø–æ—Ä—Ç–æ–≤–µ—Ç–µ **–ù–ï** –∏–º–∞—Ç IP –∞–¥—Ä–µ—Å–∏ (Layer 2 —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ)

---

#### 2. `show vlan brief`

```cisco
SW1# show vlan brief
```

**–ü–æ–∫–∞–∑–≤–∞:**
```
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5-24, Gi0/1-2
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ:**
- –í—Å–∏—á–∫–∏ –ø–æ—Ä—Ç–æ–≤–µ —Å–∞ –≤ **VLAN 1** (default)
- VLAN 1 –µ active

---

#### 3. `show mac address-table`

```cisco
SW1# show mac address-table
```

**–ü–æ–∫–∞–∑–≤–∞:**
```
Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0011.1111.1111    DYNAMIC     Fa0/1
   1    0033.3333.3333    DYNAMIC     Fa0/2
   1    0044.4444.4444    DYNAMIC     Fa0/3
   1    0055.5555.5555    DYNAMIC     Fa0/4
```

**–ö–∞–∫–≤–æ –µ MAC address table?**

Switch-—ä—Ç "–Ω–∞—É—á–∞–≤–∞" –∫–æ–π MAC –∞–¥—Ä–µ—Å –µ –Ω–∞ –∫–æ–π –ø–æ—Ä—Ç:
```
PC1 (MAC: 00:33:33:33:33:33) –µ –Ω–∞ –ø–æ—Ä—Ç Fa0/2
PC2 (MAC: 00:44:44:44:44:44) –µ –Ω–∞ –ø–æ—Ä—Ç Fa0/3

–ö–æ–≥–∞—Ç–æ –ø–æ–ª—É—á–∏ frame –∑–∞ PC1:
‚îî‚îÄ –ì–ª–µ–¥–∞ —Ç–∞–±–ª–∏—Ü–∞—Ç–∞ ‚Üí —Ñ–æ—Ä–≤–∞—Ä–¥–≤–∞ —Å–∞–º–æ –Ω–∞ Fa0/2 ‚úÖ
```

**Type: DYNAMIC** –æ–∑–Ω–∞—á–∞–≤–∞ switch-—ä—Ç –µ –Ω–∞—É—á–∏–ª –∞–≤—Ç–æ–º–∞—Ç–∏—á–Ω–æ (–Ω–µ –µ —Ä—ä—á–Ω–æ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–Ω–æ)

---

#### 4. `show interfaces status`

```cisco
SW1# show interfaces status
```

**–ü–æ–∫–∞–∑–≤–∞:**
```
Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1     Connection to R1   connected    1          a-full  a-100 10/100BaseTX
Fa0/2     PC1                connected    1          a-full  a-100 10/100BaseTX
Fa0/3     PC2                connected    1          a-full  a-100 10/100BaseTX
Fa0/4     PC3                connected    1          a-full  a-100 10/100BaseTX
Fa0/5                        notconnect   1          auto    auto  10/100BaseTX
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ –Ω–∞ –∫–æ–ª–æ–Ω–∏—Ç–µ:**

| –ö–æ–ª–æ–Ω–∞ | –ó–Ω–∞—á–µ–Ω–∏–µ | –ü—Ä–∏–º–µ—Ä |
|--------|----------|--------|
| **Port** | –ù–æ–º–µ—Ä –Ω–∞ –ø–æ—Ä—Ç–∞ | Fa0/1 |
| **Name** | Description (–∞–∫–æ –∏–º–∞) | Connection to R1 |
| **Status** | connected / notconnect | connected ‚úÖ |
| **Vlan** | –ö—ä–º –∫–æ–π VLAN –ø—Ä–∏–Ω–∞–¥–ª–µ–∂–∏ | 1 (default) |
| **Duplex** | Full/Half duplex | a-full (auto-negotiated full) |
| **Speed** | –°–∫–æ—Ä–æ—Å—Ç | a-100 (100 Mbps) |

---

## –ó–ê–î–ê–ß–ò –ó–ê –°–ê–ú–û–°–¢–û–Ø–¢–ï–õ–ù–ê –†–ê–ë–û–¢–ê

### –ó–∞–¥–∞—á–∞ 1: –î–æ–±–∞–≤–∏ –æ—â–µ –µ–¥–∏–Ω PC

**–°—Ç—ä–ø–∫–∏:**
1. –î–æ–±–∞–≤–µ—Ç–µ PC4 –≤ —Ç–æ–ø–æ–ª–æ–≥–∏—è—Ç–∞
2. –°–≤—ä—Ä–∂–µ—Ç–µ –≥–æ –∫—ä–º Switch –Ω–∞ –ø–æ—Ä—Ç **Fa0/5**
3. –ö–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–π—Ç–µ:
   - IP: `192.168.1.13`
   - Subnet Mask: `255.255.255.0`
   - Default Gateway: `192.168.1.1`
4. –î–æ–±–∞–≤–µ—Ç–µ description –Ω–∞ –ø–æ—Ä—Ç Fa0/5:
   ```cisco
   SW1(config)# interface FastEthernet0/5
   SW1(config-if)# description PC4
   ```
5. –¢–µ—Å—Ç–≤–∞–π—Ç–µ:
   ```
   –û—Ç PC4: ping 192.168.1.1
   –û—Ç PC4: ping 192.168.1.10
   ```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:** –í—Å–∏—á–∫–∏ ping-–æ–≤–µ —É—Å–ø–µ—à–Ω–∏ ‚úÖ

---

### –ó–∞–¥–∞—á–∞ 2: –ü—Ä–æ–º–µ–Ω–µ—Ç–µ hostname-–æ–≤–µ—Ç–µ

**–°—Ç—ä–ø–∫–∏:**

**–ù–∞ Router:**
```cisco
R1# configure terminal
R1(config)# hostname MyRouter
MyRouter(config)# exit
MyRouter# copy running-config startup-config
```

**–ù–∞ Switch:**
```cisco
SW1# configure terminal
SW1(config)# hostname MySwitch
MySwitch(config)# exit
MySwitch# copy running-config startup-config
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
- Prompt-—ä—Ç —Ç—Ä—è–±–≤–∞ –¥–∞ —Å–µ –ø—Ä–æ–º–µ–Ω–∏ –Ω–∞ `MyRouter#` –∏ `MySwitch#`

---

### –ó–∞–¥–∞—á–∞ 3: Banner —Å—ä–æ–±—â–µ–Ω–∏–µ (–ü–û–ü–†–ê–í–ï–ù–ê)

**Banner** –µ —Å—ä–æ–±—â–µ–Ω–∏–µ, –∫–æ–µ—Ç–æ —Å–µ –ø–æ–∫–∞–∑–≤–∞ –ø—Ä–µ–¥–∏ login.

#### –ú–µ—Ç–æ–¥ 1: –° —Ä–∞–∑–¥–µ–ª–∏—Ç–µ–ª # (—Å—Ç–∞–Ω–¥–∞—Ä—Ç–µ–Ω)

```cisco
R1# configure terminal
R1(config)# banner motd #
Enter TEXT message. End with the character '#'.
************************************************
*  Unauthorized access is strictly prohibited  *
*  All activities are logged                   *
************************************************
#
R1(config)#
```

**–í–∞–∂–Ω–æ:**
- –ù–∞–ø–∏—à–µ—Ç–µ `banner motd #` –∏ –Ω–∞—Ç–∏—Å–Ω–µ—Ç–µ Enter
- –ù–∞–ø–∏—à–µ—Ç–µ —Ç–µ–∫—Å—Ç–∞ –Ω–∞ —Å—ä–æ–±—â–µ–Ω–∏–µ—Ç–æ (–º–æ–∂–µ –¥–∞ –µ –Ω–∞ –º–Ω–æ–∂–µ—Å—Ç–≤–æ —Ä–µ–¥–æ–≤–µ)
- –ó–∞–≤—ä—Ä—à–µ—Ç–µ —Å **#** –Ω–∞ –Ω–æ–≤ —Ä–µ–¥
- **–ù–ï** –∏–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ —Å–∏–º–≤–æ–ª–∞ # –í –¢–ï–ö–°–¢–ê (–∏–Ω–∞—á–µ —â–µ –ø—Ä–∏–∫–ª—é—á–∏ –ø–æ-—Ä–∞–Ω–æ)

---

#### –ú–µ—Ç–æ–¥ 2: –° —Ä–∞–∑–ª–∏—á–µ–Ω —Ä–∞–∑–¥–µ–ª–∏—Ç–µ–ª (–∞–∫–æ # –Ω–µ —Ä–∞–±–æ—Ç–∏)

```cisco
R1(config)# banner motd $
Enter TEXT message. End with the character '$'.
************************************************
*  Unauthorized access is strictly prohibited  *
*  All activities are logged                   *
************************************************
$
```

**–ú–æ–∂–µ –¥–∞ –∏–∑–ø–æ–ª–∑–≤–∞—Ç–µ:** `$`, `%`, `@`, `&`, –∏–ª–∏ –¥—Ä—É–≥ —Å–∏–º–≤–æ–ª

---

#### –ú–µ—Ç–æ–¥ 3: –ö—Ä–∞—Ç—ä–∫ banner (–∞–∫–æ –∏–º–∞ –ø—Ä–æ–±–ª–µ–º —Å –º–Ω–æ–≥–æ—Ä–µ–¥–æ–≤–∏—è)

```cisco
R1(config)# banner motd #Unauthorized access prohibited!#
```

**–í—Å–∏—á–∫–æ –Ω–∞ –µ–¥–∏–Ω —Ä–µ–¥:** 
- –ó–∞–ø–æ—á–≤–∞ —Å #
- –¢–µ–∫—Å—Ç
- –ó–∞–≤—ä—Ä—à–≤–∞ —Å #

---

#### –ü—Ä–æ–≤–µ—Ä–∫–∞:

1. **–ò–∑–ª–µ–∑—Ç–µ –æ—Ç router-–∞:**
   ```cisco
   R1# exit
   ```

2. **–í–ª–µ–∑—Ç–µ –æ—Ç–Ω–æ–≤–æ:**
   - –ö–ª–∏–∫–Ω–µ—Ç–µ –Ω–∞ Router ‚Üí CLI tab
   - –ù–∞—Ç–∏—Å–Ω–µ—Ç–µ Enter

3. **–¢—Ä—è–±–≤–∞ –¥–∞ –≤–∏–¥–∏—Ç–µ:**
   ```
   ************************************************
   *  Unauthorized access is strictly prohibited  *
   *  All activities are logged                   *
   ************************************************
   
   User Access Verification
   Password:
   ```

---

#### –ê–∫–æ –Ω–µ —Ä–∞–±–æ—Ç–∏:

**–ü—Ä–æ–±–ª–µ–º:** Banner-—ä—Ç –Ω–µ —Å–µ –ø–æ–∫–∞–∑–≤–∞

**–í—ä–∑–º–æ–∂–Ω–∏ –ø—Ä–∏—á–∏–Ω–∏:**
1. –ó–∞–±—Ä–∞–≤–∏–ª–∏ —Å—Ç–µ `#` –≤ –∫—Ä–∞—è
2. –ò–∑–ø–æ–ª–∑–≤–∞–ª–∏ —Å—Ç–µ `#` –í —Ç–µ–∫—Å—Ç–∞ (–ø—Ä–µ–∫—ä—Å–≤–∞ banner-–∞)
3. Packet Tracer bug (—Ä—è–¥–∫–æ)

**–†–µ—à–µ–Ω–∏–µ:**
```cisco
! –ü—Ä–æ–≤–µ—Ä–µ—Ç–µ —Ç–µ–∫—É—â–∏—è banner:
R1# show running-config | include banner

! –ò–∑—Ç—Ä–∏–π—Ç–µ banner-–∞:
R1(config)# no banner motd

! –û–ø–∏—Ç–∞–π—Ç–µ —Å —Ä–∞–∑–ª–∏—á–µ–Ω —Ä–∞–∑–¥–µ–ª–∏—Ç–µ–ª:
R1(config)# banner motd $
Unauthorized access prohibited!
$
```

---

#### Banner –≤–∞—Ä–∏–∞–Ω—Ç–∏:

| –ö–æ–º–∞–Ω–¥–∞ | –ö–æ–≥–∞ —Å–µ –ø–æ–∫–∞–∑–≤–∞ |
|---------|-----------------|
| `banner motd` | **Message of the Day** - –≤–∏–Ω–∞–≥–∏ –ø—Ä–∏ login |
| `banner login` | –ü—Ä–µ–¥–∏ login prompt |
| `banner exec` | –°–ª–µ–¥ —É—Å–ø–µ—à–µ–Ω login |

**–ó–∞ —Å–µ–º–∏–Ω–∞—Ä–∞ –∏–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ `banner motd` (–Ω–∞–π-—á–µ—Å—Ç–æ —Å—Ä–µ—â–∞–Ω)**

---

### –ó–∞–¥–∞—á–∞ 4: –°—ä–∑–¥–∞–π—Ç–µ –≤—Ç–æ—Ä–æ –º—Ä–µ–∂–æ–≤–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ

**–°—Ç—ä–ø–∫–∏:**

1. **–î–æ–±–∞–≤–µ—Ç–µ SW2 (–≤—Ç–æ—Ä–∏ Switch):**
   - –î–æ–±–∞–≤–µ—Ç–µ Switch 2960
   - Hostname: `SW2`

2. **–°–≤—ä—Ä–∂–µ—Ç–µ SW1 ‚Üí SW2:**
   - SW1 Fa0/24 ‚Üê‚Üí SW2 Fa0/24

3. **–ö–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–π—Ç–µ SW2:**
   ```cisco
   Switch> enable
   Switch# configure terminal
   Switch(config)# hostname SW2
   SW2(config)# no ip domain-lookup
   SW2(config)# enable secret class123
   SW2(config)# interface vlan 1
   SW2(config-if)# ip address 192.168.1.3 255.255.255.0
   SW2(config-if)# no shutdown
   SW2(config-if)# exit
   SW2(config)# ip default-gateway 192.168.1.1
   ```

4. **–î–æ–±–∞–≤–µ—Ç–µ descriptions:**
   ```cisco
   SW1(config)# interface Fa0/24
   SW1(config-if)# description Connection to SW2
   
   SW2(config)# interface Fa0/24
   SW2(config-if)# description Connection to SW1
   ```

5. **–î–æ–±–∞–≤–µ—Ç–µ PC4 –∏ PC5:**
   - –°–≤—ä—Ä–∂–µ—Ç–µ –∫—ä–º SW2 –Ω–∞ –ø–æ—Ä—Ç–æ–≤–µ Fa0/2 –∏ Fa0/3
   - PC4: `192.168.1.14` 
   - PC5: `192.168.1.15`

6. **–¢–µ—Å—Ç–≤–∞–π—Ç–µ:**
   ```
   –û—Ç PC4: ping 192.168.1.1  (Router)
   –û—Ç PC4: ping 192.168.1.10 (PC1 –Ω–∞ SW1)
   –û—Ç PC1: ping 192.168.1.14 (PC4 –Ω–∞ SW2)
   ```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:** –í—Å–∏—á–∫–∏ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –º–æ–≥–∞—Ç –¥–∞ ping-–≤–∞—Ç –µ–¥–Ω–∏ –¥—Ä—É–≥–∏ ‚úÖ

---

## –ß–ï–°–¢–û –°–†–ï–©–ê–ù–ò –ü–†–û–ë–õ–ï–ú–ò –ò –†–ï–®–ï–ù–ò–Ø

### –ü—Ä–æ–±–ª–µ–º 1: "Destination host unreachable"

**–°–∏–º–ø—Ç–æ–º–∏:**
```
C:\> ping 192.168.1.1
Reply from 192.168.1.10: Destination host unreachable.
```

**–ü—Ä–∏—á–∏–Ω–∏:**

| –ü—Ä–∏—á–∏–Ω–∞ | –ü—Ä–æ–≤–µ—Ä–∫–∞ | –†–µ—à–µ–Ω–∏–µ |
|---------|----------|---------|
| Router –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ä—Ç –µ shutdown | `R1# show ip int brief` | `R1(config-if)# no shutdown` |
| –ì—Ä–µ—à–µ–Ω subnet mask | `ipconfig` –Ω–∞ PC | –ü–æ–ø—Ä–∞–≤–µ—Ç–µ –Ω–∞ 255.255.255.0 |
| –ì—Ä–µ—à–µ–Ω IP –∞–¥—Ä–µ—Å | `ipconfig` –Ω–∞ PC | –ü—Ä–æ–≤–µ—Ä–µ—Ç–µ —á–µ –µ –≤ 192.168.1.X |
| –ù—è–º–∞ default gateway | `ipconfig` –Ω–∞ PC | –î–æ–±–∞–≤–µ—Ç–µ 192.168.1.1 |

---

### –ü—Ä–æ–±–ª–µ–º 2: –ß–µ—Ä–≤–µ–Ω–∏ —Ç—Ä–∏—ä–≥—ä–ª–Ω–∏—Ü–∏ –Ω–∞ –≤—Ä—ä–∑–∫–∏—Ç–µ

**–°–∏–º–ø—Ç–æ–º–∏:** –í—Ä—ä–∑–∫–∏—Ç–µ –∏–º–∞—Ç —á–µ—Ä–≤–µ–Ω–∏ —Ç—Ä–∏—ä–≥—ä–ª–Ω–∏—Ü–∏ –≤–º–µ—Å—Ç–æ –∑–µ–ª–µ–Ω–∏ —Ç–æ—á–∫–∏

**–ü—Ä–∏—á–∏–Ω–∏:**
- –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏—Ç–µ –Ω–µ —Å–∞ –∞–∫—Ç–∏–≤–∏—Ä–∞–Ω–∏
- Packet Tracer –≤—Å–µ –æ—â–µ "—Å—Ç–∞—Ä—Ç–∏—Ä–∞"

**–†–µ—à–µ–Ω–∏—è:**

1. **–ò–∑—á–∞–∫–∞–π—Ç–µ 30-60 —Å–µ–∫—É–Ω–¥–∏** (—É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ç–∞ —Å–µ –∏–Ω–∏—Ü–∏–∞–ª–∏–∑–∏—Ä–∞—Ç)

2. **Fast Forward Time:**
   - –î–æ–ª–µ–Ω –¥–µ—Å–µ–Ω —ä–≥—ä–ª ‚Üí Play button
   - –£—Å–∫–æ—Ä—è–≤–∞ –≤—Ä–µ–º–µ—Ç–æ –≤ —Å–∏–º—É–ª–∞—Ü–∏—è—Ç–∞

3. **–ü—Ä–æ–≤–µ—Ä–µ—Ç–µ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏—Ç–µ:**
   ```cisco
   R1# show ip interface brief
   ! –¢—Ä—è–±–≤–∞ –¥–∞ –µ "up up"
   ```

4. **–ê–∫–æ —Å–∞ administratively down:**
   ```cisco
   R1(config)# interface GigE0/0
   R1(config-if)# no shutdown
   ```

---

### –ü—Ä–æ–±–ª–µ–º 3: PC –Ω–µ –ø–æ–ª—É—á–∞–≤–∞ IP (–∏–ª–∏ –Ω–µ –º–æ–∂–µ –¥–∞ ping)

**–°–∏–º–ø—Ç–æ–º–∏:**
```
C:\> ipconfig
IP Address: 0.0.0.0
```

**–ü—Ä–∏—á–∏–Ω–∞:** IP –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ –Ω–µ –µ –∑–∞–ø–∞–∑–µ–Ω–∞ –∏–ª–∏ –µ –Ω–∞ DHCP

**–†–µ—à–µ–Ω–∏–µ:**
1. PC ‚Üí Desktop ‚Üí IP Configuration
2. –ò–∑–±–µ—Ä–µ—Ç–µ **Static** (–Ω–µ DHCP)
3. –í—ä–≤–µ–¥–µ—Ç–µ IP, Subnet Mask, Gateway
4. –ó–∞—Ç–≤–æ—Ä–µ—Ç–µ –∏ –æ—Ç–≤–æ—Ä–µ—Ç–µ –æ—Ç–Ω–æ–≤–æ –∑–∞ –¥–∞ –ø—Ä–æ–≤–µ—Ä–∏—Ç–µ

---

### –ü—Ä–æ–±–ª–µ–º 4: Switch –Ω—è–º–∞ IP connectivity

**–°–∏–º–ø—Ç–æ–º–∏:**
```
–û—Ç PC: ping 192.168.1.2
Request timed out.
```

**–ü—Ä–∏—á–∏–Ω–∏ –∏ —Ä–µ—à–µ–Ω–∏—è:**

| –ü—Ä–∏—á–∏–Ω–∞ | –ü—Ä–æ–≤–µ—Ä–∫–∞ | –†–µ—à–µ–Ω–∏–µ |
|---------|----------|---------|
| VLAN1 –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å –µ shutdown | `SW1# show ip int brief` | `SW1(config-if)# no shutdown` –Ω–∞ interface vlan 1 |
| –õ–∏–ø—Å–≤–∞ default-gateway | `SW1# show running-config` | `SW1(config)# ip default-gateway 192.168.1.1` |
| –ì—Ä–µ—à–µ–Ω IP –∞–¥—Ä–µ—Å | `SW1# show ip int brief` | –ü–æ–ø—Ä–∞–≤–µ—Ç–µ IP –∞–¥—Ä–µ—Å–∞ |

---

### –ü—Ä–æ–±–ª–µ–º 5: Banner –Ω–µ —Å–µ –ø–æ–∫–∞–∑–≤–∞

**–ü—Ä–∏—á–∏–Ω–∞:** –ì—Ä–µ—à–Ω–∞ —Å–∏–Ω—Ç–∞–∫—Å–∏—Å –∏–ª–∏ —Ä–∞–∑–¥–µ–ª–∏—Ç–µ–ª

**–†–µ—à–µ–Ω–∏–µ:**
```cisco
! –ò–∑—Ç—Ä–∏–π —Å—Ç–∞—Ä–∏—è banner
R1(config)# no banner motd

! –ù–∞–ø—Ä–∞–≤–∏ –Ω–æ–≤ —Å –ø—Ä–æ—Å—Ç —Ç–µ–∫—Å—Ç
R1(config)# banner motd $
Unauthorized Access Prohibited
$
```

---

### –ü—Ä–æ–±–ª–µ–º 6: "Invalid input detected"

**–°–∏–º–ø—Ç–æ–º–∏:**
```
R1(config)# hsotname R1
              ^
% Invalid input detected at '^' marker.
```

**–ü—Ä–∏—á–∏–Ω–∞:** –ì—Ä–µ—à–∫–∞ –≤ –∫–æ–º–∞–Ω–¥–∞—Ç–∞ (typo)

**–†–µ—à–µ–Ω–∏–µ:**
- –ü—Ä–æ–≤–µ—Ä–µ—Ç–µ spelling (–≤ —Å–ª—É—á–∞—è: `hostname`, –Ω–µ `hsotname`)
- –ò–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ **Tab** –∑–∞ autocomplete
- –ò–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ **?** –∑–∞ –ø–æ–º–æ—â:
  ```cisco
  R1(config)# host?
  hostname
  ```

---

## CHECKLIST –ó–ê –ó–ê–í–™–†–®–í–ê–ù–ï

```
‚òê –¢–æ–ø–æ–ª–æ–≥–∏—è—Ç–∞ –µ —Å—ä–∑–¥–∞–¥–µ–Ω–∞ –ø—Ä–∞–≤–∏–ª–Ω–æ
‚òê Router –∏–º–∞ hostname R1
‚òê Switch –∏–º–∞ hostname SW1
‚òê –í—Å–∏—á–∫–∏ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∏ —Å–∞ –æ–ø–∏—Å–∞–Ω–∏ (description)
‚òê Router –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å GigE0/0 –µ –∞–∫—Ç–∏–≤–µ–Ω (up/up)
‚òê Switch VLAN1 –∏–º–∞ IP –∞–¥—Ä–µ—Å 192.168.1.2
‚òê Switch –∏–º–∞ default-gateway 192.168.1.1
‚òê –í—Å–∏—á–∫–∏ PC-—Ç–∞ –∏–º–∞—Ç –ø—Ä–∞–≤–∏–ª–Ω–∏ IP –Ω–∞—Å—Ç—Ä–æ–π–∫–∏
‚òê Ping —Ä–∞–±–æ—Ç–∏ –æ—Ç PC –¥–æ Router
‚òê Ping —Ä–∞–±–æ—Ç–∏ –º–µ–∂–¥—É PC-—Ç–∞
‚òê Ping —Ä–∞–±–æ—Ç–∏ –æ—Ç Router –¥–æ PC
‚òê Show –∫–æ–º–∞–Ω–¥–∏ –ø–æ–∫–∞–∑–≤–∞—Ç –ø—Ä–∞–≤–∏–ª–Ω–∞ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è
‚òê –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ –µ –∑–∞–ø–∞–∑–µ–Ω–∞ (copy run start)
‚òê Banner —Å—ä–æ–±—â–µ–Ω–∏–µ –µ –¥–æ–±–∞–≤–µ–Ω–æ (optional)
```

---

## –ö–ê–ö–í–û –ù–ê–£–ß–ò–•–ú–ï

1. ‚úÖ –ö–∞–∫–≤–æ –µ Router –∏ Switch (—Ä–∞–∑–ª–∏–∫–∏—Ç–µ –º–µ–∂–¥—É —Ç—è—Ö)
2. ‚úÖ –ö–∞–∫ —Å–µ —Å—ä–∑–¥–∞–≤–∞ –æ—Å–Ω–æ–≤–Ω–∞ –º—Ä–µ–∂–æ–≤–∞ —Ç–æ–ø–æ–ª–æ–≥–∏—è
3. ‚úÖ –ë–∞–∑–æ–≤–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è –Ω–∞ Router –∏ Switch
4. ‚úÖ –ö–∞–∫ —Å–µ –∑–∞–¥–∞–≤–∞—Ç IP –∞–¥—Ä–µ—Å–∏, subnet mask, gateway
5. ‚úÖ –í–∞–∂–Ω–æ—Å—Ç—Ç–∞ –Ω–∞ `no shutdown` –∫–æ–º–∞–Ω–¥–∞
6. ‚úÖ –ö–∞–∫ —Å–µ —Ç–µ—Å—Ç–≤–∞ —Å–≤—ä—Ä–∑–∞–Ω–æ—Å—Ç—Ç–∞ —Å ping
7. ‚úÖ –ö–∞–∫ —Å–µ –∑–∞–ø–∏—Å–≤–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ (running vs startup)
8. ‚úÖ –û—Å–Ω–æ–≤–Ω–∏ show –∫–æ–º–∞–Ω–¥–∏ –∑–∞ –ø—Ä–æ–≤–µ—Ä–∫–∞
9. ‚úÖ –†–µ–∂–∏–º–∏—Ç–µ –Ω–∞ —Ä–∞–±–æ—Ç–∞ (User EXEC, Privileged, Config)
10. ‚úÖ Troubleshooting –ø—Ä–∏ –æ—Å–Ω–æ–≤–Ω–∏ –ø—Ä–æ–±–ª–µ–º–∏

---

## –°–õ–ï–î–í–ê–©–ê –°–¢–™–ü–ö–ê

–í **Sem 2** —â–µ –Ω–∞—É—á–∏–º:
- **VLAN-–∏** (–≤–∏—Ä—Ç—É–∞–ª–Ω–∏ –ø–æ–¥–º—Ä–µ–∂–∏)
- **Inter-VLAN routing** (Router-on-a-Stick)
- **Trunk –ø–æ—Ä—Ç–æ–≤–µ** –º–µ–∂–¥—É switches
- **802.1Q tagging**

**–ó–∞–ø–∞–∑–µ—Ç–µ Packet Tracer —Ñ–∞–π–ª–∞ —Å–∏ –∫–∞—Ç–æ:** `Sem1_YourName.pkt`

---

## –ë–™–†–ó–ò –ö–û–ú–ê–ù–î–ò –ó–ê REFERENCE

### –û—Å–Ω–æ–≤–Ω–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è:
```cisco
enable                              ‚Üê Privileged mode
configure terminal                  ‚Üê Config mode
hostname R1                         ‚Üê –ó–∞–¥–∞–π –∏–º–µ
no ip domain-lookup                 ‚Üê –ò–∑–∫–ª—é—á–∏ DNS lookup
enable secret class123              ‚Üê –ü–∞—Ä–æ–ª–∞ –∑–∞ enable
line console 0                      ‚Üê –ö–æ–Ω–∑–æ–ª–∞ –∫–æ–Ω—Ñ–∏–≥
  password cisco
  login
  logging synchronous
```

### –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è:
```cisco
interface GigE0/0
  ip address 192.168.1.1 255.255.255.0
  description Connection to SW1
  no shutdown
```

### Switch VLAN1:
```cisco
interface vlan 1
  ip address 192.168.1.2 255.255.255.0
  no shutdown
ip default-gateway 192.168.1.1
```

### –ó–∞–ø–∏—Å–≤–∞–Ω–µ:
```cisco
copy running-config startup-config
! –∏–ª–∏
wr
```

### Show –∫–æ–º–∞–Ω–¥–∏:
```cisco
show ip interface brief             ‚Üê IP –∞–¥—Ä–µ—Å–∏ –∏ —Å—Ç–∞—Ç—É—Å
show running-config                 ‚Üê –ê–∫—Ç–∏–≤–Ω–∞ –∫–æ–Ω—Ñ–∏–≥
show startup-config                 ‚Üê –ó–∞–ø–∞–∑–µ–Ω–∞ –∫–æ–Ω—Ñ–∏–≥
show ip route                       ‚Üê Routing —Ç–∞–±–ª–∏—Ü–∞
show vlan brief                     ‚Üê VLAN-–∏
show mac address-table              ‚Üê MAC –∞–¥—Ä–µ—Å–∏
show arp                            ‚Üê ARP —Ç–∞–±–ª–∏—Ü–∞
```

---

**–£—Å–ø–µ—Ö! **
